
public class Main {
	/*
	 * 5월 1일(월) ~ 5월 7일(일) 회고록
	 * 
	 * 이번주는 스프링 CRUD에 대해서만 주구장창 한 것 같다.
	 * 
	 * Member(login, signUp) / MyPage 등은
	 * 흐름은 알겠고, 코드만 어느정도 숙지하면 될 것 같은데
	 * 
	 * Board는 잘 모르고 있다가 어제 공부하면서 많이 깨달았다.
	 * Pagination.. 인터셉터를 왜 컨트롤러 가기 전에 처리하는지,
	 * 인터셉터가 왜 필요한지... 등 많은 깨달음이 있던 시간이 어제였다.
	 * 
	 * JSP로 Board 만들 때는 이렇게 깊이 있게 생각하지 않았던 것 같다.
	 * 단순히 내 스스로가 피한 걸 수도 있다.
	 * 그치만 이번 공부로 한 가지 배운 점은 결국 언젠가는 해야한다는 것.
	 * 매도 빨리 맞는게 낫다라는 말이 괜히 있는 게 아닌 것 같다.
	 * 
	 * 그래도 Board에 대한 감은 확실히 잡았으니
	 * 이제 코드를 나의 것으로 만들면 될 것 같다.
	 * 
	 * 오늘도 화이팅하자구~★☆★☆★
	 *
	 * 
	 * 
	 */
}
